//Модуль для спілкування з користувачем та виведення на екран потрібних результатів
#ifndef __MENU_H__
#define __MENU_H__
void menu();//головне меню, з якого можна отримати результати роботи будь-якого
    //з алгоритмів, або поглянути на тести корректності роботи цих алгоритмів
void OutTable(float ordered, float random, float backordered, int flag);
//виведення таблиці результатів роботи алгоритма
void OutSortArray(clock_t(*sortalh)(int***,int,int,int));
//виведення результатів сортування невеликого масиву для перевірки корректності
//роботи обраного алгоритма(передаєтся параметром)
void OutSortArray(clock_t(*sortalh)(int***,int,int,int));
//виведення результатів сортування невеликого вектора для перевірки корректності
//роботи обраного алгоритма(передаєтся параметром)
#endif // __MENU_H__
