#ifndef COMMONVECTOR_H_INCLUDED
#define COMMONVECTOR_H_INCLUDED
/*модуль для підключення потрібних бібліотек, експорта функцій та
виділення пам'яті, також модуль містить загальні дані про тривимірний
масив та вектор, які використовуються для підрахунку часу алгоритму*/

#include <stdio.h>
#include <stdlib.h>
#include <math.h>
//Бібліотека, яка потрібна для використання функції clock();
#include <time.h>
//Бібліотека для роботи з динамічнимим даними
#include <malloc.h>
//Розміри 3-вимірного масиву, який використовуємо для підрахунку часу роботи алгоритмів
#define Pt 150000//К-сть перерізів масиву
#define Mt 16//К-сть рядків у одному перерізі масива
#define Nt 16//К-сть стовбчиків у одному перерізі масива
// Розмір вектора, який використовуємо для підрахунку часу роботи алгоритмів
#define VectorLength 150000

//Оголошення вектора сум стовбчиків для зручнішого використання у функціях
int sum[Pt];
// Оголошення тривимірного масиву для використання його в сортуваннях
extern int*** Arr;
// Оголошення вектора для використання його в сортуваннях
int Vector[VectorLength];
//Функція виділення динамічної пам'яті для масиву
void ArrayMemory(int P, int M, int N);
// Функція яка заповнює 3-вимірний масив
void ArrayFill(int ***Arr, int order, int P, int M, int N);
// Функція яка заповнює вектор .
void VectorFill(int order);
//Функція звільнення пам'яті від динамічного масиву
void FreeArray(int P, int M);
#endif // COMMONVECTOR_H_INCLUDED
